ErpTest/src/Catalogs/УчетныеПолитикиОрганизаций/УчетныеПолитикиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеПолитикиОрганизаций</name>
  <attributes>
    <name>МетодОценкиСтоимостиТоваров</name>
    <type>
      <types>EnumRef.МетодыОценкиСтоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяУчетНДСПоФактическомуИспользованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяПБУ18</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетГотовойПродукцииПоПлановойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСчет40</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Учитывать5ПроцентныйПорог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьРезервыПоСомнительнымДолгамБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьРезервыПоСомнительнымДолгамНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗабалансовыйУчетТМЦВЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводкиПоРаботникам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимозачетЧерезСчет76</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяПлательщикомНДПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодНачисленияАмортизацииНУ</name>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьРезервОтпусковБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьРезервОтпусковНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодНачисленияРезерваОтпусков</name>
    <type>
      <types>EnumRef.МетодыНачисленияРезервовОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативОтчисленийВРезервОтпусков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредельнаяВеличинаОтчисленийВРезервОтпусков</name>
    <type>
      <types>DefinedType.ДенежноеПолеНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНалогообложенияУСН</name>
    <type>
      <types>EnumRef.ОбъектыНалогообложенияПоУСН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаНаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеНомерУСН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеДатаУСН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНалогаУСН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределенияКосвенныхРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.БазыРаспределенияКосвенныхРасходовПоВидамДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСхемаУчетаСтоимостиОСвНУ</name>
    <type>
      <types>EnumRef.УдалитьСхемыУчетаСтоимостиОСвНУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУчетаНДСПриИзмененииВидаДеятельности</name>
    <type>
      <types>EnumRef.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовНеНДС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовНеНДС</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовЕНВД</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовЕНВД</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВариантУчетаСтоимостиТоваров</name>
    <type>
      <types>EnumRef.УдалитьВариантыУчетаСтоимостиТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОтбораАвансовДляРегистрацииСчетовФактур</name>
    <type>
      <types>EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВСоставНалоговыхРасходовЛизинговыеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаТоваровЧерезСчет20</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяОсвобождениеОтУплатыНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаздельныйУчетТоваровПоНалогообложениюНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаздельныйУчетПостатейныхПроизводственныхЗатратПоНалогообложениюНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетНДСДлительногоЦиклаПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУплатыАвансовПоНалогуНаПрибыль</name>
    <type>
      <types>EnumRef.ПорядокУплатыАвансовПоНалогуНаПрибыль</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСборкаТоваровЧерез20СчетНеТребуетОбновления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпределятьИзлишкиРезервовОтпусковЕжемесячно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаздельныйУчетТоваровПоНалогообложениюНДСНеТребуетОбновления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Catalogs/УчетныеПолитикиОрганизаций/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ФормироватьРезервОтпусковБУ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МетодНачисленияРезерваОтпусков");
	КонецЕсли;
	
	//++ НЕ УТ
	Если (Не ФормироватьРезервОтпусковБУ Или
		ФормироватьРезервОтпусковБУ И МетодНачисленияРезерваОтпусков <> Перечисления.МетодыНачисленияРезервовОтпусков.НормативныйМетод)
		И Не ФормироватьРезервОтпусковНУ Тогда
	//-- НЕ УТ
		МассивНепроверяемыхРеквизитов.Добавить("НормативОтчисленийВРезервОтпусков");
		МассивНепроверяемыхРеквизитов.Добавить("ПредельнаяВеличинаОтчисленийВРезервОтпусков");
	//++ НЕ УТ
	КонецЕсли;
	//-- НЕ УТ
	
	//++ НЕ УТ
	Если Не ПрименяетсяЕНВД ИЛИ Не СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		МассивНепроверяемыхРеквизитов.Добавить("БазаРаспределенияКосвенныхРасходовПоВидамДеятельности");
	КонецЕсли;
	//-- НЕ УТ
	
	Если Не ПрименяетсяЕНВД Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходовЕНВД");
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовЕНВД");
	КонецЕсли;
	
	Если НЕ РаздельныйУчетТоваровПоНалогообложениюНДС
	 ИЛИ ВариантУчетаНДСПриИзмененииВидаДеятельности = Перечисления.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимость
	 ИЛИ СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходовНеНДС");
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовНеНДС");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяРасходовЕНВД");
		МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовЕНВД");
	Иначе
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходовЕНВД, "КонтролироватьЗаполнениеАналитики") <> Истина Тогда
			МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовЕНВД");
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходовНеНДС, "КонтролироватьЗаполнениеАналитики") <> Истина Тогда
			МассивНепроверяемыхРеквизитов.Добавить("АналитикаРасходовНеНДС");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	РегистрыСведений.УчетнаяПолитикаОрганизаций.СкорректироватьЗависимыеПараметрыУчетнойПолитики(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Запись настроек в регистр УчетнаяПолитикаОрганизаций
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизаций.Организация.ЮрФизЛицо КАК ЮрФизЛицо,
	|	УчетнаяПолитикаОрганизаций.Период КАК Период
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних КАК УчетнаяПолитикаОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика = &УчетнаяПолитика";
	
	Запрос.УстановитьПараметр("УчетнаяПолитика", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//++ НЕ УТ
		
		Набор = РегистрыСведений.НастройкиРасчетаРезервовОтпусков.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.Установить(Выборка.Организация);
		Набор.Отбор.Период.Установить(НачалоГода(Выборка.Период));
		
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.Организация             = Выборка.Организация;
		СтрокаНабора.Период                  = НачалоГода(Выборка.Период);
		
		// настройки резервов
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ЭтотОбъект,
			"ФормироватьРезервОтпусковБУ, ФормироватьРезервОтпусковНУ, МетодНачисленияРезерваОтпусков, НормативОтчисленийВРезервОтпусков, ПредельнаяВеличинаОтчисленийВРезервОтпусков");
		СтрокаНабора.ОпределятьИзлишкиЕжемесячно = ЭтотОбъект.ОпределятьИзлишкиРезервовОтпусковЕжемесячно;
		
		Набор.Записать(Истина);
		
		//-- НЕ УТ
		
		Набор = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.Установить(Выборка.Организация);
		Набор.Отбор.Период.Установить(Выборка.Период);
		
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.Организация             = Выборка.Организация;
		СтрокаНабора.Период                  = Выборка.Период;
		СтрокаНабора.УчетнаяПолитика         = ЭтотОбъект.Ссылка;
		
		// кэшируемые параметры учетной политики
		ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.СформироватьКэшируемыеПараметрыУчетнойПолитики(ЭтотОбъект, Выборка);
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ПараметрыУчетнойПолитики);
		
		Набор.Записать(Истина);
		
	КонецЦикла;
	
	УстановитьЗначенияЗависимыхКонстант();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Кэширует значения некоторых реквизитов учетных политик организаций в константах.
//
Процедура УстановитьЗначенияЗависимыхКонстант()
	
	//++ НЕ УТ
	ОтражениеЗарплатыВБухучетеРасширенный.УстановитьИспользованиеЕНВД();
	//-- НЕ УТ
	
	// Константа ИспользоватьРаздельныйУчетПоНалогообложению:
	// устанавливается в Истина если хоть в одной учетной политике реквизит РаздельныйУчетТоваровПоНалогообложениюНДС = Истина
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Политики.Значение КАК Значение
	|ИЗ
	|	Константы КАК Константы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕСТЬNULL(МАКСИМУМ(Т.РаздельныйУчетТоваровПоНалогообложениюНДС), ЛОЖЬ) КАК Значение
	|		ИЗ
	|			Справочник.УчетныеПолитикиОрганизаций КАК Т) КАК Политики
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Константы.ИспользоватьРаздельныйУчетПоНалогообложению <> Политики.Значение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Константы.ИспользоватьРаздельныйУчетПоНалогообложению.Установить(Выборка.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
